<template>
	<div class="prose max-w-none">
		<h2 class="text-lg lg:text-xl font-semibold text-dark mb-4">Как это работает?</h2>
		<ol class="list-decimal pl-6 mb-6">
			<li>Регистрация: Создайте профиль, указав только основные данные.</li>
			<li>Добавление объектов: Заполните форму квиза, чтобы рассказать о своей недвижимости.</li>
			<li>Поиск и обмен: Укажите свои пожелания, и система предложит подходящие варианты для обмена.</li>
			<li>Связь с владельцами: Общайтесь напрямую через встроенный чат для обсуждения деталей.</li>
			<li>Оформление сделки: Все обмены фиксируются через платформу для вашей защиты.</li>
		</ol>
	</div>
</template>

