<template>
	<div class="prose max-w-none">
		<h1 class="text-xl lg:text-2xl font-semibold text-dark mb-4 lg:mb-6">O M2 Exchange™</h1>
		<p class="mb-4">
			M2 Exchange – это инновационная платформа для обмена недвижимостью между странами, созданная для упрощения процесса поиска и организации взаимовыгодных обменов. Мы предоставляем пользователям возможность находить подходящую недвижимость для временного или постоянного обмена, будь то квартира, дом или коммерческое помещение.
		</p>
		<p class="mb-6">
			Наша миссия – сделать процесс обмена недвижимостью удобным, безопасным и доступным для всех.
		</p>

		<h2 class="text-xl font-semibold text-dark mb-4">Ключевые особенности M2 Exchange</h2>
		<ul class="list-disc pl-6 mb-6">
			<li>Простота регистрации: Мы минимизировали процесс регистрации, чтобы вы могли быстрее начать искать подходящие объекты.</li>
			<li>Интерактивные формы: Удобные квизы помогают вам легко добавить информацию о ваших объектах и пожеланиях к обмену.</li>
			<li>Безопасность: Каждый профиль и объект проходит проверку, чтобы обеспечить доверие и безопасность для всех участников платформы.</li>
			<li>Глобальное сообщество: Наша платформа объединяет владельцев недвижимости из разных стран, позволяя находить уникальные варианты обмена.</li>
		</ul>

		<h2 class="text-xl font-semibold text-dark mb-4">Как это работает?</h2>
		<ol class="list-decimal pl-6 mb-6">
			<li>Регистрация: Создайте профиль, указав только основные данные.</li>
			<li>Добавление объектов: Заполните форму квиза, чтобы рассказать о своей недвижимости.</li>
			<li>Поиск и обмен: Укажите свои пожелания, и система предложит подходящие варианты для обмена.</li>
			<li>Связь с владельцами: Общайтесь напрямую через встроенный чат для обсуждения деталей.</li>
			<li>Оформление сделки: Все обмены фиксируются через платформу для вашей защиты.</li>
		</ol>
	</div>
</template>

